Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/D17B.tmx
Source language: en_us
Languages: zh_cn

source: Teachings of Buddha
zh_cn: 佛陀的教谕

source: This article discusses a few of the basic teachings of Buddah.
zh_cn: 这篇文章讨论了佛陀的几个基本教谕。

source: While you might not be into Eastern philosophy, the teachings of Buddha can have an impact on your life in many ways, whether you know it or not.
zh_cn: 尽管你可能对东方哲学不感兴趣，无论你是否知道佛陀的教谕会在多方面来影响你的生活。

source: Here are a few words of advice from someone who understands the key to happiness.
zh_cn: 下面是某个懂得幸福关键人所提出的一些劝言。

source: Life is so hard, how can we be anything but kind?
zh_cn: 生活实在太难了，我们怎么能够一点都不仁慈呢？

source: You know your life isn't easy- you live it every day.
zh_cn: 你知道，日子难过天天过。

source: But have you ever stopped to think that we as the human race are all in the same boat?
zh_cn: 然而你是否曾经停下来想过，我们，作为人类都蹲在同一条船上？

source: No matter if you have money, or friends, or a great job, you still probably think your life is lacking something.
zh_cn: 不管你是否有钱，是否有朋友，或是否有期望中的工作，很可能你仍然会想到你的生活还缺少些什么。

source: Everyone feels that way.
zh_cn: 每个人都是这样的感觉。

source: Your rich neighbor has marital problems; your happy in-laws wish they had enough money to retire early.
zh_cn: 你那有钱邻居有婚姻上的问题；你那生活幸福的姻亲希望有够多的财产早些退休。

source: Life is hard for everyone, and it is for that reason that we should live our lives with kindness and compassion for everyone we encounter.
zh_cn: 每一个人生活都很难，这因为如此，我们应该带着仁慈和同情、理解的心情来对待所遇到的人，以度过我们的人生。

source: The key isn't how easy we can make our lives; it's how kind we can be while living our lives.
zh_cn: 关键不在于怎样才能使我们自己的生活过得容易，而在于在我们过日子的同时，怎样才能仁慈地去对待他人。

source: Buddha teaches that our sorrows and wounds are healed only when we touch with compassion.
zh_cn: 佛陀告诉我们，当我们与同情和怜悯产生联系时，我们内心的悲痛和创伤才可能被治愈。

source: Everyone has some kind of sorrow or wound in their soul. You do, I do, your friends do.
zh_cn: 每个人在心灵上都有某种悲痛和创伤：你是这样，我是这样，你的朋友也是这样。

source: Most people walk around with their hidden wounds, wondering if they can ever be healed.
zh_cn: 多数人带着他们隐藏在内心深处的创伤在到处走动，他们要想知道这些创伤能否被治愈。

source: People spend countless hours and time in therapy seeking healing.
zh_cn: 人们花了无数的时间去治疗这些创伤以谋求康复。

source: But there really is a simple way to get that relief, and it comes from within.
zh_cn: 但是，实际上在那里只能获得有来自内部解脱的简单方法。

source: We must treat ourselves with compassion, the way we would respond to the sorrows of a friend.
zh_cn: 我们必须用同情和怜悯来治疗我们自己，也就是用我们去应对朋友伤心事的同一种方法。

source: If you can only befriend yourself and learn to love and nurture yourself, you can heal any wounds you have.
zh_cn: 只有你能帮助你自己和学会去爱你自己和鼓励你自己，你就可以治愈你所具有的任何创伤。

source: Joy comes not through possessions or ownership but through a wise and loving heart.
zh_cn: 快乐不是来自财产或占有，而是通过明智和爱心。

source: This is a tricky one for most people.
zh_cn: 这个问题对多数人来说会感到很微妙。

source: Our society is based on commercialism and consumerism, and we are brought up to believe we must keep up with the Jones in order to be happy.
zh_cn: 我们的社会是以营利和消费为基础，我们从小就养成了相信必须在社会地位和物质生活方面，在与同左邻右舍的攀比中以获取幸福。

source: We spend, spend, spend.
zh_cn: 我们花费、花费，再花费。

source: What we end up with is a lot of stuff we don't need or want and an empty feeling that doesn't go away.
zh_cn: 到头来以很多我们并不需要和并不缺乏的东西或者以挥之不去的空虚感来告终。

source: Instead of focusing on gaining possessions, true happiness comes from focusing on your heart.
zh_cn: 请不要把心思集中在占有财产，真正的幸福来是关注你的心态。

source: Get to know your true dreams and desires, and learn what you need to make you happy.
zh_cn: 要了解你真正的梦想和愿望，认识到你需要什么才能快乐。

source: Listen to your heart and it will tell you all you need to know.
zh_cn: 要倾听你自己的心声，它会告诉你所需要知道的一切。

source: Each morning we are born again.
zh_cn: 每天的早晨相当于我们再次重生。

source: What we do today is what matters most.
zh_cn: 我们今天所要做的就是你当前最重要的事。

source: We only have one chance to live the life we are given, but each new day is a new beginning.
zh_cn: 我们只有一次机会去度过赋给我们的一生，但每个新的一天都是新的开始。

source: It's a gift to us -the chance to do today what we didn't do yesterday.
zh_cn: 新的一天是赋给我们的礼物——使我们今天有机会去做昨天没有做的事。

source: It doesn't matter what you did yesterday, or what you didn't do.
zh_cn: 它与你昨天做的，或者没有做的无关。

source: You have another day love, nurture, and reach out with kindness to your fellow man.
zh_cn: 这样，你就有了爱、教养，和伸出手来善待你同伴的另一天。

source: If yesterday wasn't exactly what you would have liked, don't beat yourself up over it.
zh_cn: 如果昨天过得并不像你所希望的那样，也不要因此来责备自己。

source: Treat yourself with love and compassion and do it right today.
zh_cn: 用爱和同情心来对待你自己而在今天把事做好。

source: And don't forget, you have tomorrow too.
zh_cn: 而且不要忘记，你还有明天。

source: Buddha says that health is the greatest gift, contentment the greatest wealth.
zh_cn: 佛陀说健康是最重要的礼物，知足是最大的财富。

source: These are things we all tend to overlook or take for granted because they aren't necessarily how our society measures success.
zh_cn: 这些都是我们容易忽视或认为理所当然的事，因为它们不是我们社会衡量成功所必需的。

source: But just think about if you didn't have your health.
zh_cn: 但只要想想假如你没有了健康。

source: It would be the only thing you would want.
zh_cn: 健康是你应该需要的仅有东西。
